#Задача 2: Найдите сумму цифр трехзначного числа.

# number = int(input("Введите трехзначное число: "))
# print(f"Сумма цифр в заданном числе равна: {number%10 + (number % 100 // 10) + number//100}")

# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# s = int(input("Введите сколько всего журавликов было сделано: "))
# print(f"Катя сделала {s / 2} журавликов, а Петя и Сережа сделали по {s / 2 / 2} поделки") #не до конца понял как сделать для нечетного кол-ва решение.
#В условии не прописано что их четное кол-во.