# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть

# from random import randint
# money = int(input("Введите кол-во монет: "))
# one_side, other_side = 0, 0
# i = 0
# while i < money:
#     side = randint(0,1)
#     if side == 0:
#         one_side += 1
#         i += 1
#         print(f"Решка выпала {one_side} раз")
#     else:
#         other_side += 1
#         i += 1
#         print(f"Орел выпал {other_side} раз")

# if one_side > other_side:
#     print(f"Наименьшее кол-во монет которые следует перевернуть: {other_side}")
# else:
#     print(f"Наименьшее кол-во монет которые следует перевернуть: {one_side}")

# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. 
# Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.
