# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.



# n = int(input("Введите количество элементов первого множества: ")) 
# m = int(input("Введите количество элементов второго множества: "))

# set_1 = set() 
# set_2 = set()

# print("Введите элементы первого множества:") 
# for i in range(n): set_1.add(int(input()))

# print("Введите элементы второго множества:") 
# for i in range(m): set_2.add(int(input()))

# result_set = set_1.intersection(set_2) 
# result_list = list(result_set) 
# result_list.sort()

# print("Результат:", result_list)