# За день машина проезжает n километров. Сколько дней потребуется машине чтобы проехать m километров?
# print("Введите целое число которое будет являтся скоростью машины км/д: ")
# n = int(input())
# print("Введите кол-во километров которые необходимо преодолеть машине: ")
# m = int(input())
# s = m // n
# print(f"Количество дней затраченное на преодоление дистанции равно {s}")

# Три класса нужно оборудовать партами. Два ученика за партой. Если известно сколько всего учащихся то напишите программу, которая вычеслит наименьшее кол-во парт необходимое школе.

# kab1 = int(input("Введите кол-во учеников первого кабинета: " ))
# kab2 = int(input("Введите кол-во учеников второго кабинета: " ))
# kab3 = int(input("Введите кол-во учеников третьего кабинета: " ))
# print(f"необходимое кол-во парт равно: {(kab1 + kab2 + kab3) // 2 + ((kab1 + kab2 + kab3) % 2 !=0)}") 
